cask_args appdir: '/Applications'

brew 'brew-cask-completion'

brew 'binutils'
brew 'coreutils'
brew 'findutils'
brew 'moreutils'

brew 'bash'
brew 'bash-completion'
brew 'bash-git-prompt'

brew 'git'
brew 'git-extras'

brew 'autoconf'
brew 'automake'

brew 'exa'
brew 'gpg'
brew 'gpg2'
brew 'nmap'
brew 'the_silver_searcher'
brew 'tig'
brew 'wget'

brew 'bat'
brew 'eth-p/software/bat-extras'

# First wave install

brew 'mas'
mas '1Password', id: 443_987_910
mas 'Bear', id: 1_091_189_122
mas 'Things 3', id: 904_280_696

tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

cask 'alfred'
cask 'firefox'
cask 'iterm2'
cask 'little-snitch'
cask 'visual-studio-code'

# Second wave install

brew 'freetype'
brew 'libjpeg'
brew 'libtiff'

cask 'docker'
cask 'flow'
cask 'google-drive-file-stream'
cask 'grandperspective'
cask 'kindle'
cask 'micro-snitch'
cask 'muzzle'
cask 'pocket-casts'
cask 'protonvpn'
cask 'selfcontrol'
cask 'slack'
cask 'sourcetree'
cask 'spotify'
cask 'subtitle-master'
cask 'the-unarchiver'
cask 'toggl'

mas 'Amphetamine', id: 937_984_704
mas 'Moom', id: 419_330_170
mas 'Numbers', id: 409_203_825
mas 'XMind: ZEN - Mind Mapping', id: 1_327_661_892
mas 'Xcode', id: 497_799_835

# brew 'postgresql'
# brew 'redis'
# cask 'firefox-nightly'
# cask 'google-chrome'
# cask 'licecap'
# cask 'mendeley'
# cask 'microsoft-office'
# cask 'sublime-text'
# cask 'telegram'
# cask 'virtualbox'
# cask 'vlc'
# mas 'Keynote', id: 409_183_694
# mas 'Monosnap - screenshot editor', id: 540_348_655
# mas 'Twitter', id: 409_789_998
